<?php
/**
 * 业务响应码
 */
return [
    /* 成功响应类 */
    0  => '请求成功',
    1  => '创建成功',
    2  => '请求已接受',
    3  => '非授权信息',
    4  => '无内容',
    5  => '重置内容',

    /* 权限错误类 */
    9001 => '需要登录',
    9002 => '登录会话已过期',
    9003 => '无访问权限',
    9004 => 'Csrf token 错误',
    9005 => 'Certificate 参数错误',
    9006 => '该操作在测试环境不可用',

    /* 服务器错误类 */
    9993 => '远程服务调用失败',
    9994 => '用户已登录，但获取失败',
    9995 => '数据库操作失败',
    9996 => '功能未实现',
    9997 => '服务不可用',
    9998 => '服务器内部错误',
    9999 => '普通错误',

    /* 请求错误、资源错误类 */
    10000 => '请求参数错误',
    10001 => '接口不支持当前请求方法',
    10002 => '资源已删除',
    10003 => '未找到资源',

    /* 业务错误类 - APP */
    11000 => '应用 ID 错误',
    11001 => '应用 UUID 错误',
    11002 => '应用名称错误',
    11003 => '应用类型或应用标签 ID 错误',
    11004 => '应用标签 ID 错误',
    11005 => '该应用类型已存在',
    11006 => '该应用标签已存在',
    11007 => '应用 ID 列表包含不同维度应用标签的应用',
    11008 => '应用标签列表包含属于不同父类的标签',
    11009 => '应用 ID 不存在',

    /* 业务错误类 - Placement */
    12000 => '广告位 ID 错误',
    12001 => '广告位 UUID 错误',
    12002 => '广告位名称错误',
    12003 => '广告位 ID 不存在',

    /* 业务错误类 - Publisher */
    13000 => '开发者 ID 错误',
    13001 => '开发者未设置邮箱',

    /* 业务错误类 - Network */
    14000 => '广告厂商 ID 错误',

    /* 业务错误类 - Strategy */

    /* 业务错误类 - Contents */
    16001 => 'Posts ID 错误',

    /* 业务错误类 - ADX */
    17000 => 'ADX demand 不存在',
];